app/Traits/Customer.php

  private function _checkCustomer($idUser){
    try{
      $customer = \App\Customer::where('user_id', $idUser)->firstOrFail();
---
select * from "customers" where "user_id" = 11 limit 1