app/Http/Controllers/HomeController.php

  public function index()
  {
    $categories = Category::with('medias')->where('category_id', null)->get();

    $products = Product::with('sizeUnit','volumeUnit','weightUnit', 'medias')->get()->random(6);
---
select * from "categories" where "category_id" is null
select * from "medias" where "medias"."category_id" in (1, 2, 6, 9, 12)
select * from "medias" where "medias"."product_id" in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48)
select * from "products"